controllers/SiteController.php

INSERT INTO `form` (`name`, `email`, `age`, `height`, `weight`, `city`, `techies`, `english_level`) VALUES ('22', '11@mail.ru', 22, 185, 21, '33k', 'yes_camera', 'starter')
INSERT INTO `images` (`id`) VALUES (DEFAULT)
INSERT INTO `images` (`form_id`, `images`) VALUES (53, '/home/rost/www/project1.dev/web/uploads/15_minutes.png;/home/rost/www/project1.dev/web/uploads/black_small.png;')
---
public function actionForm()
{
    $model = new Form();
    $images = new Images();
    if($model->load(Yii::$app->request->post()) && $images->load(Yii::$app->request->post()) && $model->save()){
            $images->form_id = $model->id;
            $images->imagesFiles = UploadedFile::getInstances($images,'imagesFiles');
        $message = Yii::$app->mailer->compose()
            ->setFrom('prozrostl@gmail.com')
            ->setTo($model->email)
            ->setSubject('Hello from Yii2')
            ->setTextBody('Имя' . $model->name . '' . 'Возраст' . $model->age . '' . 'Рост' . $model->height . '' . 'Вес' . $model->weight . '' . 'Нужна ли техника' . $model->techies . '' . 'Уровень английского' . $model->english_level . '');
            foreach ($images->imagesFiles as $file){
                $folder = (\Yii::$app->basePath.'/web/uploads/'.$file->name);
                $file->saveAs(\Yii::$app->basePath.'/web/uploads/'.$file->name);
                $images->images .=$folder . ';';
                $message->attach($folder);